public class Exercise2 {
    public static void main(String[] args) {
        //Напишите программу, которая выводит на экран сумму двух чисел.
        // 54 + 16

        byte sum = 54 + 16;

        System.out.print ("Результат операции = ");
        System.out.println(sum);


    }
}
