public class Exercise4 {
    public static void main(String[] args) {
        //Напишите программу, которая выводит на экран значение
        // переменной типа int  в квадрате (n* n). Предварительно объявите
        // эту переменную и задайте ее значение.

        int intValue1 = 275;
        int a1 = 2;
        System.out.printf("Результат операции = %.0f \n", Math.pow(intValue1, a1));
    }
}
