public class Exercise3 {
    public static void main(String[] args) {
        //Напишите программу, которая выводит на экран результат деления двух чисел.
        // 50/3

        double doubleValue1 = 50;
        double doubleValue2 = 3;
        double doubleResultDiv = doubleValue1 / doubleValue2;

        System.out.print ("Результат операции = ");
        System.out.println(doubleResultDiv);
    }
}
